{
    "chapter_number": "1",
    "chapter_title": "Role of the Scout Platoon",
    "sections": [
        {
            "section_number": "0",
            "section_title": "Role of the Scout Platoon",
            "section_content": "The scout platoon’s mission is to conduct reconnaissance and security operations to answer the commander’s information requirements and provide early warning to the protected force. Specifically, it conducts tasks to satisfy the commander’s critical information requirements (CCIRs) before the latest time the information is of value (LTIOV) expires. Commanders specifically assign the scout platoon missions for any given operation based on known and projected friendly operations, the range of threats, and their understanding of potential areas of operations (AO). Scouts then confirm or deny commanders’ assumptions.\nScout platoons conduct reconnaissance and security missions in close contact with enemy organizations and civilian populations to allow maneuver commanders to seize, retain, and exploit the initiative and obtain a position of relative advantage."
        },
        {
            "section_number": "1",
            "section_title": "Overview",
            "section_content": "1-1.  Scout platoons are the eyes and ears of the commander. They uniquely organize, train, and equip to conduct reconnaissance and security tasks. The role of the scoutplatoon is to conduct reconnaissance and security missions that satisfy informationrequirements to allow commanders to make decisions.\n\n1-2.  The execution of reconnaissance and security missions provides supported unitsinformation, time, and space to adjust to the changing situation, react to opportunitiesand danger, and enable commanders to transition to future operations. For example, scout platoons conducting reconnaissance allow commanders to transition from defenseto offense. By establishing a screen, scout platoons provide the commander with early warning of enemy activities with enough time to react and space to maneuver their orces. Scout platoons enable the commander to determine enemy intent, willingness to fight, and preserve freedom of maneuver.\n\n1-3.  Scout platoons are the primary reconnaissance asset in the Cavalry troop, and the organic reconnaissance unit available to Infantry and combined arms battalions. By providing timely and accurate information during reconnaissance and security missions, the commander can progressively build situational awareness of the operational environment. During security, the scout platoon provides commanders with reaction time and maneuver space and allows them to understand the situation more clearly. Collectively, scouts conducting reconnaissance and security missions aid the commander in decision making and directing follow-on or future operations.\n\n1-4.  Scout platoons execute missions with organic and external reconnaissance assets to identify and target enemy forces and capabilities, and provide maneuver space and reaction time for the protected force. When performing its fundamental role, the scout platoon makes the following contributions (not in order of priority)—\n\n    • Provide an effective all weather, reconnaissance capability.\n\n    • Maximize security by providing reaction time and maneuver space to preserve combat power through economy of force.\n\n    • Facilitate commander’s situational awareness and understanding with timely and accurate reporting.\n\n    • Enable the operations and intelligence processes by satisfying information requirements.\n\n    • Facilitate commander’s visualization of the operational environment that aids decision making to achieve or preserve the decisive operation.\n\n    • Assist in shaping the AO by providing information or directing fires to disrupt the threat.\n\n    • Facilitate tactical movement across the AO by conducting route reconnaissance.\n\n    • Detect threat cover and concealment, deception, and decoys.\n\n1-5.  The primary focus of the scout platoon is to answer supported CCIR.  CCIR is an information requirement tied to a decision point and identified by the commander as being critical for facilitating timely decision making and successful execution of military operations priority intelligence requirements (PIRs). CCIR includes PIR and friendly force information requirements. PIR is an intelligence requirement, stated as a priority for reconnaissance and security tasks and intelligence collection that the commander needs to understand about a threat, enemy, or adversary or about the operational environment (for example, terrain or civil considerations) (JP 2-01). PIR identifies the information about the enemy and the operational environment that the commander considers most important. PIR, along with friendly forces information requirements, are the two essential elements of CCIR. Scout platoons conduct reconnaissance and security missions to answer PIR, which normally tie to either a named area of interest (NAI) or a target area of interest (TAI). See chapter 2 for further discussion on CCIR and decision point NAI linkage.\n\n1-6.  The scout platoon operates consistent with and guided by the fundamentals of reconnaissance and security during planning, preparation, and execution of its missions (see table 1). See chapters 3 and 4 of this publication for greater detail of these fundamentals.\n\n1-7. The scout platoon’s five-core reconnaissance and security missions follow below. While not a core reconnaissance and security mission, local security is a priority task and responsibility of all Army units as a force protection measure.\n\n    • Zone reconnaissance.\n\n    • Area reconnaissance.\n\n    • Route reconnaissance.\n\n    • Screen.\n\n    • Area security.\n\n1-8. The scout platoon operates in support of a larger force conducting a guard or cover, which may include offensive and defensive operations. The platoon may be directed to conduct screening or reconnaissance missions during the larger unit's guard or cover mission.",
            "image_id": "Table1-1",
            "section_page_numbers": "1-1, 1-2, 1-3, 1-4, 1-5, 1-6, 1-7, 1-8",
            "subsections": [
                {
                    "subsection_title": "SCOUTS IN DECISIVE ACTION",
                    "subsection_content": "1-9.  Unified action is the synchronization, coordination, and/or integration of the activities of governmental and nongovernmental entities with military operations to achieve unity of effort (JP 1). The Army’s contribution to unified action is unified land operations. (See ADP 3-0 for more information.) The Army executes unified land operations through decisive action tasks. Unified land operations are the simultaneous execution of offense, defense, stability, and defense support of civil authorities across multiple domains to shape operational environments, prevent conflict, prevail in large- scale ground combat, and consolidate gains as part of unified action. (ADP 3-0). Scout platoons conduct reconnaissance and security to support their higher commanders during all decisive action tasks. Cavalry forces conduct reconnaissance to support higher commanders, especially when transitioning between decisive action tasks.\n\n1-10.  Both brigade combat team(BCT) and maneuver battalion commanders task scout platoons against their decisive point where scouts conduct zone, area, and route reconnaissance missions, to confirm or deny assumptions, or provide the commander more information on enemy, terrain, or civilian populations.\n\n1-11.  The commander provides guidance to the battalion/squadron or brigade operations staff officer (S-3) and battalion or brigade intelligence staff officer (S-2) to develop CCIR for their decision points. They task scout platoons to gather the required information as expressed as indicators to inform their actions. For example, a Stryker battalion commander may task their scout platoon to conduct an area reconnaissance mission for a suitable area to deploy their companies for an attack. An Infantry battalion commander might employ their scout platoon in a screen to their front during the defense to provide reaction time and maneuver space allowing a company to reposition based on reported approaching enemy formations.\n\nVARIABLES OF THE OPERATIONAL ENVIRONMENT\n\n1-12.  The operational environment evolves as each operation progresses.Thetwotypes of variables are operational and mission. Army leaders use operational variables to analyze and understand a specific operational environment and use mission variables to focus on specific elements during mission analysis (see ADP 3-0 for more information). The operational variables are political, military, economic, social, information, infrastructure, physical environment, and time. (Refer to ADP 5-0 for more information.)\n\n1-13. Thesecondtypeofvariableismissionvariables,whichdescribescharacteristics of the AO focusing on how they affect a mission. The mission variables are mission, enemy, terrain and weather, troops and support available, time available, and civil considerations (METT-TC). (Refer to ADP 5-0 for more information.)",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-9, 1-10, 1-11"
                },
                {
                    "subsection_title": "VARIABLES OF THE OPERATIONAL ENVIRONMENT",
                    "subsection_content": "1-12.  The operational environment evolves as each operation progresses.The two types of variables are operational and mission. Army leaders use operational variables to analyze and understand a specific operational environment and use mission variables to focus on specific elements during mission analysis (see ADP 3-0 for more information). The operational variables are political, military, economic, social, information, infrastructure, physical environment, and time. (Refer to ADP 5-0 for more information.)\n\n1-13. The second type of variable is mission variables, which describes characteristics of the AO focusing on how they affect a mission. The mission variables are mission, enemy, terrain and weather, troops and support available, time available, and civil considerations (METT-TC). (Refer to ADP 5-0 for more information.)",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-12, 1-13"
                }
            ]
        },
        {
            "section_number": "2",
            "section_title": "Threat",
            "section_content": "1-14. A threat is any combination of actors, entities, or forces that have the capability and intent to harm U.S. forces, U.S. national interests, or the homeland (ADP 3-0). Threats may include individuals, groups of individuals, paramilitary or military forces, nation-states, or national alliances. In general, threats are an enemy or an adversary:\n\n    • An enemy is a party identified as hostile against which the use of force is authorized (ADP 3-0).\n\n    • An enemy is also called a combatant and is treated as such under the law of war.\n\n    • An adversary is a party acknowledged as potentially hostile to a friendly party and against which the use of force may be envisaged (JP 3-0).",
            "image_id": "",
            "section_page_numbers": "1-14",
            "subsections": [
                {
                    "subsection_title": "REGULAR AND IRREGULAR THREAT DESCRIPTION",
                    "subsection_content": "1-15.  Regular. These include peer and near-peer threats that train, equip, and organize to conduct combined arms maneuver. They employ modern and modernized weapons systems capable of defeating or competing with like U.S. systems.\n\n1-16.  Irregular. These include insurgent, guerilla, terrorist, paramilitary, and criminal organizations. These threats attempt to win by exhausting U.S. national will by inflicting long-term expenditure of American lives and treasure. (See FM 3-24 for more information.) A hybrid threat employs a combination of regular and irregular forces. See TC 7-100 series and supporting products for more information on hybrid warfare, threat equipment, and potential future operating environments.\n\nTHREAT IMPACT ON SCOUTS\n\n1-17. Scout platoons face an elusive, diverse, flexible, and adaptive enemy. The enemy is capable of combining a wide array of lethal and nonlethal weapons, including modern peer, near-peer, hybrid threats, and improvised systems, presenting a complex enemy situation for friendly reconnaissance and security forces. Scouts may face combined arms organizations that outnumber the scout platoon and overmatch the weapons of friendly scout platoons and sections. The enemy uses traditional, unconventional, and hybrid tactics to present numerous challenges for friendly forces by combining electronic warfare (EW) and cyber weapons with the following capabilities—\n\n    • Infantry.\n\n    • Armed vehicle equipped insurgents, either individually or in groups.\n\n    • Mechanized forces.\n\n    • Antiarmor systems.\n\n    • Indirect fires.\n\n    • Unmanned aircraft systems (individual and massed).\n\n    • Cyber/EW attacks.\n\n1-18.  destroy information-collection effort. The enemy may employ stationary observation posts integrated with insurgents operating individually or in teams among the population. They may also use unmanned aircraft system (UAS) to identify and target friendly reconnaissance units or to pass information to highly mobile, counterreconnaissance forces. Conventional and unconventional counterreconnaissance forces conduct complex ambushes to defeat or destroy scout platoons to prevent collection and reporting of information.\n\n1-19.  During security missions, the enemy will attempt infiltration through the security force with the intent to identify friendly strengths, weaknesses, key command communications elements, or influence the protected population. The enemy endeavors to identify and target key communication nodes or critical capabilities that disrupt our ability to maintain security and limit our freedom of maneuver. They will continue to employ EW to affect positioning, navigation, and timing. Simultaneously, the enemy may employ insurgents or criminal elements within the population to collect information. They then transmit the information through messengers using inconspicuous visual signals (tire fires, animal flock movements, flags, flyers, and posters), and various electronic means. Insurgents employ terrorist tactics to disrupt and create fear amongst the populace to distract friendly security forces and limit our ability to collect information. Insurgent forces may target patrols, observation posts, and logistics package (LOGPAC) with improvised explosive devices (IEDs) and ambushes.\n\n1-20.  The enemy may also utilize subterranean passages, avenues of approach, and hideouts to evade friendly forces or conduct sudden attacks from unexpected directions. Enemy EW efforts may include spoofing or jamming to disrupt positioning, navigation, and timing to deny effective communications and precise targeting. The enemy will link its activities with information operations to influence the local and international audience and gain support.",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-15, 1-16"
                },
                {
                    "subsection_title": "THREAT IMPACT ON SCOUTS",
                    "subsection_content": "1-17. Scout platoons face an elusive, diverse, flexible, and adaptive enemy. The enemy is capable of combining a wide array of lethal and nonlethal weapons, including modern peer, near-peer, hybrid threats, and improvised systems, presenting a complex enemy situation for friendly reconnaissance and security forces. Scouts may face combined arms organizations that outnumber the scout platoon and overmatch the weapons of friendly scout platoons and sections. The enemy uses traditional, unconventional, and hybrid tactics to present numerous challenges for friendly forces by combining electronic warfare (EW) and cyber weapons with the following capabilities—\n\n    • Infantry.\n\n    • Armed vehicle equipped insurgents, either individually or in groups.\n\n    • Mechanized forces.\n\n    • Antiarmor systems.\n\n    • Indirect fires.\n\n    • Unmanned aircraft systems (individual and massed).\n\n    • Cyber/EW attacks.\n\n1-18.  destroy information-collection effort. The enemy may employ stationary observation posts integrated with insurgents operating individually or in teams among the population. They may also use unmanned aircraft system (UAS) to identify and target friendly reconnaissance units or to pass information to highly mobile, counterreconnaissance forces. Conventional and unconventional counterreconnaissance forces conduct complex ambushes to defeat or destroy scout platoons to prevent collection and reporting of information.\n\n1-19.  During security missions, the enemy will attempt infiltration through the security force with the intent to identify friendly strengths, weaknesses, key command communications elements, or influence the protected population. The enemy endeavors to identify and target key communication nodes or critical capabilities that disrupt our ability to maintain security and limit our freedom of maneuver. They will continue to employ EW to affect positioning, navigation, and timing. Simultaneously, the enemy may employ insurgents or criminal elements within the population to collect information. They then transmit the information through messengers using inconspicuous visual signals (tire fires, animal flock movements, flags, flyers, and posters), and various electronic means. Insurgents employ terrorist tactics to disrupt and create fear amongst the populace to distract friendly security forces and limit our ability to collect information. Insurgent forces may target patrols, observation posts, and logistics package (LOGPAC) with improvised explosive devices (IEDs) and ambushes.\n\n1-20.  The enemy may also utilize subterranean passages, avenues of approach, and hideouts to evade friendly forces or conduct sudden attacks from unexpected directions. Enemy EW efforts may include spoofing or jamming to disrupt positioning, navigation, and timing to deny effective communications and precise targeting. The enemy will link its activities with information operations to influence the local and international audience and gain support.",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-17, 1-18, 1-19, 1-20"
                }
                
            ]
        },
        {
            "section_number": "3",
            "section_title": "Key Personnel",
            "section_content": "1-21.  Every scout in the platoon needs required information to accomplish the mission. Providing a clear task, purpose, and commander’s intent coupled with reconnaissance and security guidance to all echelons allows scout platoons to exercise disciplined initiative and complete the mission successfully, regardless of setbacks or losses.\n\n1-22.  Duties and responsibilities as outlined below are a guideline for all scout platoons. Task organization (known as TASKORG) or absence of personnel may warrant other members of the scout platoon performing additional duties outside their traditional scope. All scouts must be proficient in their responsibilities, which are listed below, and of the next higher position to accomplish the mission successfully.",
            "image_id": "",
            "section_page_numbers": "1-21, 1-22",
            "subsections": [
                {
                    "subsection_title": "COMMON RESPONSIBILITIES",
                    "subsection_content": "1-23. All leaders assume the duties of the next higher leader in their absence and take initiative to accomplish the mission in the absence of orders. They are responsible for what their echelon does or fails to do, and employs their echelon as directed by the scout platoon leader. They position themselves where they can influence the most critical tasks of the mission.\n\n1-24.  During planning all leaders adhere to timelines using backwards planning from LTIOV and understand commander’s intent and that of the commander two levels up. They assist the platoon leader in planning direct/indirect fire control measures and also understand key tasks and information collection requirements and employ their echelon to accomplish them. The following common responsibilities apply to all scout platoon leadership regardless of position:\n\n    • Supervise or assist in selection, construction, and occupation of observation posts and firing positions.\n\n    • Ensure participation in and execution of mission critical rehearsals.\n\n    • Understand the capabilities and limitations of available personnel and equipment in and attached to the platoon.\n\n    • Use standardized report formats to keep the platoon leader informed.\n\n    • Employ indirect fires and Army attack helicopters.\n\n    • Control fires and establishes fire control measures.\n\n    • Perform precombat checks and inspections(PCC/PCI).\n\n    • Issue a five-point contingency plan when they leave the vehicle.",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-23, 1-24"
                    
                },
                {
                    "subsection_title": "DUTIES AND RESPONSIBILITIES",
                    "subsection_content": "1-25. The following duties apply to all scout platoon formations. The next higher leader is responsible to ensure subordinates successfully execute their duties.",
                    "subsection_image_id": "",
                    "sub_subsection": [
                        {
                            "sub_subsection_title": "PLATOON LEADER",
                            "sub_subsection_content": "1-26. The scout platoon leader develops trust and understanding with the commander and subordinates. The entire platoon must execute disciplined initiative consistent with the commander’s reconnaissance and security guidance and train subordinates to do the same.\n\n1-27. The platoon leader is responsible for what the platoon does or fails to do, including tactical employment, training, administration, personnel management, and logistics. Successful platoon leaders handle this responsibility by planning, making timely decisions, issuing orders, assigning tasks, and supervising platoon activities.\n\n1-28. Scout platoon leaders fully understand the capabilities and limitations of personnel and equipment in and attached to their platoon. They develop and adhere to timelines using backwards planning from LTIOV, and understand the commanders intent and that of the commander two levels up, allowing them to exercise disciplined initiative to accomplish the mission in the absence of orders. Platoon leaders ensure key tasks and information requirements are understood by all subordinates. They backbrief the commander on their plan to accomplish the mission and allot time for section leaders to plan their section’s scheme of maneuver. They evaluate enemy threat at the platoon level and template threats down to the team, and continually plan and reassess one phase ahead during execution. They plan communications to enable early and accurate warning through timely and accurate reporting, maneuver their elements, and employ fires and other enablers.\n\n1-29. During planning, platoon leaders use parallel planning to issue operation orders (OPORD), fragmentary orders (FRAGORD), and warning orders (WARNORD). The platoon leader works with the troop fires support officer and develops a scheme of fires overlay. They assign subordinates as observers, develop a scheme of air overlay, and provide clear guidance to the UAS and Army attack aviation assets.\n\n1-30. The platoon leader directs and assists the platoon sergeant (known as PSG) in planning and executing sustainment. They conduct planning with the help of the leaders and attachments within the platoon and develop redundant (digital and analog) graphic control measures for distribution. Platoon leaders conduct troop leading procedures (TLP) and identify the need for enablers and assets, synchronize them, and request them in a timely manner. They coordinate with adjacent units and understand that unit’s mission. Prior to execution, they perform PCI according to their platoon standard operating procedures (SOPs).\n\n1-31. During execution, scout platoon leaders position themselves where they can influence the most critical tasks of the mission while controlling fires and establishing fire control measures. They use standardized report formats to keep the commander informed and maneuver sections by providing guidance to the section leader to accomplish the mission. Additionally, they collect section range cards and prepare a platoon sector sketch. They direct the development and refinement of the platoon’s pre- execution tasks, and make adjustments when required.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-26, 1-27, 1-28, 1-29, 1-30, 1-31"
                        },
                        {
                            "sub_subsection_title": "PLATOON SERGEANT",
                            "sub_subsection_content": "1-32.  The PSG is the senior noncommissioned officer(NCO)in the platoon and second in succession of command. The senior most experienced scout in the platoon and the only NCO that assumes a leadership role from a commissioned officer, the PSG provides expertise, helps, and advises the platoon leader. They lead the platoon in the platoon leader’s absence, and supervise the platoons’ administration, logistics, and maintenance. The PSG assists the platoon leader with the development of paragraph four of the OPORD. PSGs understand the commander’s intent and that of the commander two levels up.\n\n1-33.  The PSGs primary focus is directing all resupply and maintenance activities. The PSG receives requests from the section leader for rations, water, ammunition, and replacement equipment, and conducts coordination directly with the troop first sergeant (1SG), or executive officer (XO) using standardized report formats for all classes of supply. They develop the scheme of support overlay and distribute it across the platoon.\n\n1-34.  The PSG supervises and directs the platoon medic, combat lifesaver (CLS) personnel, and aid and litter teams. They develop and supervise the platoon’s casualty collection plan and all medical evacuation (MEDEVAC) and casualty evacuation (CASEVAC) plans.\n\n1-35.  Additionally, the PSG maintains platoon status of personnel, weapons, and equipment and submits standardized reports to the commander or 1SG. They ensure that ammunition, supplies, and loads are evenly distributed.\n\n1-36.  They monitor the morale, discipline, and health of the platoon and ensure that the platoon adheres to the platoon leader’s timeline. The PSG enforces compliance with platoon and troop SOPs.\n\n1-37.  The PSG conducts PCC and is responsible for the security plan during all operations. They confirm and recommend locations of the casualty collection point (CCP), ambulance exchange point, logistic release point (known as LRP), and maintenance collection point (known as MCP), and template them on the scheme of support overlay. The PSG delegates responsibility to section leader to confirm or deny suitability of all CCPs/ambulance exchange points/LRPs/MCPs) templated on the scheme of support overlay. The PSG enforces net discipline amongst the platoon, and distributes priorities of work during all phases of operations.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-32, 1-33, 1-34, 1-35, 1-36, 1-37"
                        },
                        {
                            "sub_subsection_title": "SECTION LEADER",
                            "sub_subsection_content": "1-38.  The term section leader is used to denote which squad leader (known as SQDLDR) is in charge of a specific TASKORG. The section leader is responsible for the tactical employment and combat readiness of their section, including the health, welfare, and training of Soldiers, and maintenance of weapons and equipment of their squad. They help the platoon leader plan the scheme of maneuver and make relevant recommendations during planning and execution.\n\n1-39.  The section leader maintains section status of personnel, weapons, and equipment and submits standardized reports to the platoon leader or PSG. They ensure that ammunition, supplies, and loads are evenly distributed in the section. Section leaders direct the maintenance of the section's weapons and equipment and perform PCC.\n\n1-40.  The section leaders delegate tasks to squad and team leaders, and supervises their accomplishment. While maneuvering their section during execution, within the platoon leader’s guidance, the section leader will refine the plan to meet the needs of a changing operational environment.\n\n1-41.  Additionally, the section leader assists the platoon leader in planning direct and indirect fire control measures and employs indirect fires and Army aviation assets. They understand key tasks and information collection requirements and employ their section to accomplish them. They prepare a section sector sketch and develop a route reconnaissance overlay in support of route reconnaissance missions.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-38, 1-39, 1-40, 1-41"
                        },
                        {
                            "sub_subsection_title": "SQUAD LEADERS",
                            "sub_subsection_content": "1-42.  The SQDLDR is responsible for the combat readiness and tactical employment of their squad and scout vehicle. They supervise the health, welfare, and training of Soldiers, and maintenance of the vehicle, equipment, and weapons.\n\n1-43.  The SQDLDRs maintain the squads’ status of personnel, weapons, and equipment, and submit standardized reports to the section leader. They ensure that ammunition, supplies, and loads are evenly distributed, and direct the maintenance of the squads’ weapons and equipment. Additionally, they employ indirect fires and aviation assets.\n\n1-44.  The SQDLDRs help the section leader plan the scheme of maneuver. They delegate tasks to team leaders (known as TLs) and subordinates, and supervise their accomplishment. SQDLDRs follow the platoon leader’s plan and make recommendations, understand key tasks and information collection requirements and employ their squad to accomplish them. They plan for aspects of long duration observation posts, dismounted reconnaissance and security patrols, and prepare a range card, DA Form 5517 (Standard Range Card).",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-42, 1-43, 1-44"
                        },
                        {
                            "sub_subsection_title": "TEAM LEADER",
                            "sub_subsection_content": "1-45.  The TL sassist SQDLDRs by providing direct oversight and supervision of their scouts. TLs are the first link in the chain of command and are responsible for the combat readiness and tactical employment of their team, the health, welfare, and training of Soldiers, and the maintenance of equipment and weapons.\n\n1-46.  TLs interpret commander’s intent and reconnaissance and security guidance into directed actions for Soldiers. TLs inform the squad leader of preparation status by personally checking on: scout’s readiness of equipment such as vehicle fluid levels, filled canteens, and packed rucksacks according to the tactical SOP. Additionally, the TL verifies sensitive items and ammunition status, checking weapons and ammunition, and prepares their team for PCC and PCI.\n\n1-47.  TLs delegate tasks to subordinates, and supervise the subordinate actions. They inform and provide recommendations to the SQDLDR. They employ indirect fires and aviation assets. They prepare to establish OPs and lead patrols. TLs establish communications security, fill loads into radios, and other equipment. They prepare a range card, for the squad/section leader.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-45, 1-46, 1-47"
                        },
                        {
                            "sub_subsection_title": "GUNNER",
                            "sub_subsection_content": "1-48. The gunner is responsible for the combat readiness and tactical employment of their weapon system, and vehicle mounted communications systems. Additionally, the gunner maneuvers the vehicle, as directed, in the absence of the vehicle commander.\n\n1-49.  The gunner performs the maintenance, assembly, disassembly, and operator checks of the weapon system. During an engagement the gunner will detect, identify, engage, and assess enemy targets as directed by the vehicle commander. They recognize firing angle limitations and direct the driver to reposition the vehicle to eliminate them. The gunner coordinates sector responsibilities over voice communications systems with other vehicle gunners throughout the platoon during missions.\n\n1-50.  Gunners prepare a range card and assume control of the vehicle in the absence of the vehicle commander. They assist in navigating and maneuvering the vehicle. They employ their vehicle/weapon system/optics to accomplish the tasks and requirements, delegate tasks to the driver, and supervise their accomplishment.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-48, 1-49, 1-50"
                        },
                        {
                            "sub_subsection_title": "DRIVER",
                            "sub_subsection_content": "1-51.  The driver is responsible for the combat readiness and tactical employment of their vehicle. The driver tactically maneuvers the vehicle as directed by the vehicle commander.\n\n1-52.  Drivers perform the preventive maintenance and operator checks of the vehicle and equipment. They maintain vehicle status of personnel, weapons, equipment, and petroleum, oils, and lubricants, and submit reports to the gunner.\n\n1-53.  The driver recognizes firing angle limitations and repositions the vehicle to eliminate them. They assume control of the vehicle in the absence of the crew and assist in navigating and maneuvering the vehicle. The driver is always looking for the next covered and concealed position during maneuvering and communicates it to the vehicle commander.\n\n1-54.  They assist the gunner in maintaining and employing all communication systems mounted in the vehicle. They perform PCC ensuring that ammunition, supplies, and loads are evenly distributed and secured in the vehicle.\n\n1-55.  They receive a five-point contingency plan when personnel leave the vehicle. They observe their sector of responsibility, camouflage the vehicle, and provide local security when needed. Drivers help detect, identify, and assess enemy targets. They maintain and improve on all scout skills.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-51, 1-52, 1-53, 1-54, 1-55"
                        },
                        {
                            "sub_subsection_title": "SCOUT",
                            "sub_subsection_content": "1-56.  Scouts understand how to stealthily navigate through terrain to close in and report on enemy units. They move to positions of advantage, establish well-camouflaged and emplaced observation posts, and send accurate and timely reports to their higher element. Scouts use their sensors and systems to identify and observe NAIs for the commander. They are experts with their analog and digital reporting systems, and they apply these systems to report as much detailed and pertinent information as possible to inform higher commanders.\n\n1-57.  Scouts assume duties of the team leader in their absence. They are experts with their rifle, its optics, and its laser-aiming device, and are effective with their weapon system both day and night. They are capable of engaging all targets with well-aimed shots. They employ all weapons of the squad and are proficient in their individual and assigned tasks. Scouts know the duties of their teammates and prepare to execute their mission, as needed.\n\n1-58.  Scouts understand their requirements as a member of a special team (detainee search, aid/litter, site exploitation, CLS, demolitions, and wire/mine breach teams). They manage their food, water, and ammunition during missions, and maintain proper vehicle, individual, and equipment camouflage during all operations. They provide local security, perform the maintenance and operator checks of their equipment, and accomplish all assigned tasks.\n\n1-59.  Scouts make relevant recommendations to the team leader, and understand the capabilities and limitations of personnel and equipment, in and attached, to their platoon. They observe their sector of responsibility, and employ all scout skills to accomplish the mission. They are proficient in use of indirect fires. They understand how to collect information on routes and in areas as directed by the team leader. Scouts understand the fundamentals of reconnaissance and security and collect and provide information to assist leaders.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-56, 1-57, 1-58, 1-59"
                        },
                        {
                            "sub_subsection_title": "SPECIAL WEAPONS",
                            "sub_subsection_content": "1-60. Scouts carrying special weapons; grenade launcher, machine guns, Javelin, or Stinger have the same duties as the scout with the addition of the following: engages targets with appropriate type of rounds, both day and night and understands the capabilities and limitations of equipment employment. They perform the maintenance and operator checks on their equipment.\n\n1-61.  The scout grenadier can identify 40-mm(millimeter) rounds by shape and color, and know how to employ each type of round. They know each rounds minimum safety constraints and the maximum ranges for each type of target. The grenadier is familiar with the leaf sight increments without reading the markings. Additionally, they know how to make an adjustment from the first round fired to obtain a second-round impact. The grenadier is proficient in quick reloading, firing in all positions, and accurate when firing on the move.\n\n1-62.  The machine gunner accurately engages groups of enemy personnel, thin-skinned vehicles, bunker doors or apertures, and suspected enemy locations with automatic fire. They provide suppressive fire on selected targets to enable the supported unit to maintain freedom of maneuver.\n\n1-63.  Machine gunners must engage targets from the prone, kneeling, and standing positions, with and without night observation devices. They are responsible for their assistant gunner and all the gun equipment, and knowing the ballistic effects of the weapon on all types of targets.\n\n1-64.  The javelin gunner engages targets both day and night, know show to employ the javelin, its minimum safety constraints, and knows the maximum effective range of the javelin. Javelin gunners understand the capabilities and limitations of equipment employment considerations. They perform the maintenance and operator checks on missiles and on the command launch unit and maintain batteries for the command launch unit. They operate and troubleshoot the command launch unit without the use of a flashlight.\n\n1-65.  The Stinger gunner defends the scout platoon from air threats. A second person helps carry the equipment. They engage targets both day and night and know how to employ the Stinger and its minimum safety constraints, while also understanding the maximum effective range of the Stinger.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-60, 1-61, 1-62, 1-63, 1-64, 1-65"
                        },
                        {
                            "sub_subsection_title": "RADIO TELEPHONE OPERATOR",
                            "sub_subsection_content": "1-66. The scout acting as radio telephone operator (knownasRTO) is there to maintain communications with higher, adjacent units, and attachments. The RTO maintains communications at all prescribed times and takes actions necessary to regain communications, sends and receives all reports using standardized formats, and is an expert at employing field expedient antennas.\n\n1-67. The RTO maintains a copy of the signal operating instructions and assists the platoon leader with information management. They manage battery usage and signal output during operations in accordance with communication windows and SOPs.\n\n1-68. The RTO maintains communications equipment and employs the assigned crypto key filling device. They perform the maintenance and operator checks on their assigned communications equipment. RTOs understand the capabilities and limitations of equipment employment considerations consistent with displaced and dispersed locations. They understand actions taken when they encounter a meaconing, intrusion, jamming and interference threat.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-66, 1-67, 1-68"
                        },
                        {
                            "sub_subsection_title": "COMBAT MEDIC",
                            "sub_subsection_content": "1-69. Combat medics reside in the medical platoon and support the Cavalry squadron. Combat medics attach to Cavalry troops with one combat medic per scout platoon and one senior combat medic per troop. The combat medic makes their assessment, administers initial medical care, initiates a DD Form 1380 (Tactical Combat Casualty Care [TCCC] Card), then requests evacuation or returns the scout to duty. The combat medic also assists in the training of the platoon’s CLSs in enhanced first-aid procedures, and requisitions class VIII supplies from the squadron aid station (known as SAS).",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-69"
                        },
                        {
                            "sub_subsection_title": "FORWARD OBSERVER (TROOP LEVEL)",
                            "sub_subsection_content": "1-70. The forward observer (FO), along with their RTO, is the scout platoon’s subject matter expert on indirect fire planning and execution. They advise the scout platoon leadership on the employment and execution for all fire support assets, including troop mortars, field artillery, and other allocated fire support assets. They are responsible for locating targets, and calling and adjusting indirect fires. The fire support team also knows the mission and concept of operation, specifically the scout platoon’s scheme of maneuver, and concept of fires and is the scout platoon leader’s indirect fire expert.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-70"
                        },
                        {
                            "sub_subsection_title": "MORTARS (TROOP LEVEL)",
                            "sub_subsection_content": "1-71. Circumstances may warrant dismounted mortar teams be attached to the scout platoon. Soldiers of the platoon may have to carry ammunition for the mortars during movements. Planning for additional weight and making load adjustments for the Soldiers facilitate mission accomplishment.\n\n1-72. They must understand the platoon’s scheme of maneuver and know their current location while maintaining communication with the fire direction center (FDC). They assist the platoon leader in planning for use of indirect fires and assist with planning and selection of the mortar firing point. Additionally, they plot fires and determine firing data.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-71, 1-72"
                        },
                        {
                            "sub_subsection_title": "HABITUAL ENABLERS",
                            "sub_subsection_content": "1-73. Scout platoons may receive additional attachments to those listed here. See chapter 6 for an expanded and more detailed discussion of possible attachments to the scout platoon. In general, scout platoons should understand the following information from attachments:\n\n  • Whatistheirmission?\n  • What capabilities do they bring to the fight?\n  • Whataretheirlimitations?\n  • Who has control of them?\n  • Howdotheymoveandmaneuver?\n  • Who has responsibility for their sustainment?\n  • What are their communication capabilities (radio frequencies, call signs)?\n  • How long will they remain and where do they go once their mission is complete?\n  • How do you locate them for a face-to-face linkup?",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-73"
                        }
                    ],
                    "subsection_page_numbers": "1-25"
                }
            ]
        },
        {
            "section_number": "4",
            "section_title": "ORGANIZATIONS",
            "section_content": "1-74. Below are the current capabilities and limitations common to each of the BCT scout platoons. Also provided below are descriptions for the organization, equipment, capabilities, and limitations that are specific for each of the scout platoons.",
            "image_id": "",
            "section_page_numbers": "1-74",
            "subsections": [
                {
                    "subsection_title": "COMMON SCOUT PLATOON CAPABILITIES AND LIMITATIONS",
                    "subsection_content": "1-75. The following general capabilities and limitations apply to all types of scout platoons. Specific platoon capabilities center on the formation types discussed below.\n\n1-76. Each scout platoon can conduct simultaneous reconnaissance of one area per scout section. The size of each area depends on factors such as the available road network, terrain features, anticipated enemy activity, reconnaissance tasks to perform, availability of UAS and Army aviation to support, and the time available. Each platoon can conduct a detailed zone reconnaissance at a rate dependent on METT-TC and number of tasks associated with the mission. All scout platoons can reconnoiter two routes in a permissive no-threat environment, one route in a low-threat environment, and one route as a subordinate element conducting reconnaissance as a troop in a medium to high-threat environment.\n\n1-77. Scout platoons provide all weather, accurate, and timely reconnaissance and security in nonrestrictive, restrictive, and urban terrain using surveillance systems, and mounted and dismounted scouts.\n\n1-78. Scout platoons employ integrated sensors and systems to defeat enemy deception, decoys, and cover and concealment that would otherwise remain undetected.1-79.\n\nEach scout platoon can also—\n  • Operate in three scout sections or two scout sections to respond to changes in the mission variables of METT-TC.\n  • Conduct mounted and dismounted reconnaissance or security concurrently at the platoon, section, and squad level.\n  • Conduct three dismounted patrols concurrently.\n  • Operate three mounted and three dismounted observation posts for more than 12 hours.\n  • Operate six mounted and six dismounted observation posts for up to 12hours.\n  • Communicate with and report information by voice and data over distances normally associated with beyond line-of-sight communications.\n  • Observe, detect, identify, and classify enemy elements during the conduct of reconnaissance and security tasks.\n  • Operate in close proximity to the enemy and among civilian populations.\n  • Defeat, destroy, or impede enemy reconnaissance elements within capabilities.\n  • Integrate attachments to identify enemy signatures and enable multidomain reconnaissance and security.\n  • Move at speeds equal to or faster than the supported unit.\n  • Lead and train squads, teams, and crews with NCOs.",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-75, 1-76, 1-77, 1-78, 1-79"
                },
                {
                    "subsection_title": "SCOUT SQUAD",
                    "subsection_content": "1-80. The purpose of the scout squad is to conduct reconnaissance and security missions, provide local security, establish observation posts, and clear intervisibility (known as IV) lines for their section and platoon. A scout squad enables depth through the combination of mounted and dismounted scouts. The vehicle crew (vehicle commander, driver, and gunner) perform the primary vehicle duties, including crew gunnery qualification. The squad possesses a dismounted capability that task organizes based on mission requirements. Therefore, all scouts must be proficient on maintaining their vehicle, their mounted weapon systems, and the M320 grenade launcher, the Javelin Missile System, and the M240B machine gun. Cross-training mounted and dismounted tasks across the squad increases the squad’s flexibility and ability to sustain reconnaissance and security mission requirements.\n\n1-81. The composition of the scout squads differ across the formations of the Armored brigade combat team (ABCT), Stryker brigade combat team (SBCT), Infantry brigade combat team (IBCT), combined arms battalions and Infantry battalion. The composition of the scout squads are listed in paragraphs 1-83 to 1-86.\n\n1-82. The ABCT and SBCT Cavalry troops have six scout squads within each scout platoon. Each squad consists of six personnel and one reconnaissance vehicle (Bradley or Stryker).\n\n1-83. The ABCT combined arms battalion has six scout squads within the scout platoon. Three of the squads consist of six personnel and a Bradley and three squads consist of four personnel and a high mobility multipurpose wheeled vehicle (HMMWV) or Joint Light Tactical Vehicle.\n\n1-84. The IBCT Cavalry squadron has six scout squads within each scout platoon of the mounted troops. Each squad consists of four personnel and a reconnaissance vehicle (HMMWV). The IBCT Cavalry squadron dismounted troop has three scout squads within each scout platoon and each squad consists of eight personnel.\n\n1-85. The IBCT Infantry battalion scout platoon has three scout squads within each scout platoon. Each squad consists of six personnel and two vehicles (HMMWVs or Joint Light Tactical Vehicles).",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-80, 1-81, 1-82, 1-83, 1-84, 1-85"
                },
                {
                    "subsection_title": "SCOUT SECTION",
                    "subsection_content": "1-86. Regardless of scout platoon formation, platoons may task organize as two or three section concepts. Characteristics shared by all scout sections are in the following paragraphs.\n\n1-87. Each scout platoon consists of two or three scout sections. Each section includes two or three scout squads. The scout platoon leader and PSG designate the section leader to lead the Alpha and Bravo sections. The headquarters section includes the platoon leader and the PSG, depending on how the platoon task organizes.\n\n1-88. In some cases, the platoon may fight as a single entity, which is most common when the platoon supports a higher-level security mission such as a guard. When a section employs its dismounted teams as a squad-sized dismounted element, a squad leader usually dismount to lead the teams.\n\n1-89. The platoon leader or PSG may dismount to perform specific leader tasks. In such a case, a team leader assumes responsibility for the vehicle to provide leadership to the mounted team.\n\n1-90. The platoon leader or PSG may operate together within a command section or separately. METT-TC variables may require them to operate with other sections to ensure effective mission command.\n\n1-91. The scout section requires its two scout vehicles and their mounted teams to conduct coordinated tactical movements. Mounted scout squads must have the capability to operate and move their vehicles, command their vehicles, or lead the movement of the section’s vehicles. The mounted teams require the ability to secure themselves and their vehicles at the short halt while maintaining the ability to move immediately.\n\n1-92. Scout sections must operate their primary weapons and optics concurrently, and remain on the platoon’s communications and mission command systems. Mounted teams require sufficient personnel to minimally operate their vehicle while one Soldier from the vehicle dismounts to provide local security. In the case of a scout section equipped with Bradleys’ or Stryker Infantry carrier vehicles the gunners may dismount to provide local security while the vehicle commander and driver remain to control weapons, optics, communications, and the vehicle itself. In the case of Stryker reconnaissance vehicles or up-armored light wheeled platform variants with two crew positions on the vehicle, the third Soldier in the mounted team, not part of the dismounting scout teams, fulfills the local security requirement at the short halt.\n\n1-93. The scout section security missions are normally screening missions. When screening, the section must have enough personnel to monitor communications, use the vehicle’s primary optic and primary weapon, and move the vehicle. Other Soldiers in the section maintain the dismounted observation post, provide local security, and conduct periodic patrols. Additionally during long duration missions, over 12 hours, the section executes squad- and team-size dismounted patrols. When the section employs a six Soldier dismounted patrol, the two mounted three-Soldier teams assume local security and mounted observation post duties.",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-86, 1-87, 1-88, 1-89, 1-90, 1-91, 1-92, 1-93",
                    "sub_subsection": [
                        {
                            "sub_subsection_title": "TWO SECTION",
                            "sub_subsection_content": "1-94. Use the two-section organization when there is a requirement for increased security, when two elements can efficiently cover a sector, or when the threat situation is unknown. The two-section organization allows for maximum dismounts and is best suitable for area reconnaissance missions.\n\n1-95 Advantages to a two-section organization are—\n  • Easier to gain fire superiority.\n  • Effective if there are only two high-speed avenues of approach to observe.\n  • Simplified command and control, senior leader (platoon leader or PSG) in each section.\n  • Easier to effectively mass personnel.\n  • Simplified mission command.\n  • Easier CASEV AC.\n\n1-96 The disadvantages to a two-section organization are—\n  • Harder to disperse forces over a wider area.\n  • Higher chance of compromise due to massing of sound and visual signature.\n  • Harder to conduct simultaneous reconnaissance on more than two NAIs.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-94, 1-95, 1-96"
                        },
                        {
                            "sub_subsection_title": "THREE SECTION",
                            "sub_subsection_content": "1-97. Use the three-section organization when there is a requirement to cover a wider area or there are multiple avenues of approach and area of interests within the platoon’s zone or screen. The three-section organization provides added depth to the platoon’s screen.\n\n1-98 Advantages of a three-section organization are—\n  • Easier to disperse forces over a wider area.\n  • Easier to conduct simultaneous reconnaissance of more than two NAIs.\n  • Lesser chance of compromise because forces are spread out.\n  • Easier to form a headquarters section with platoon leader and PSG in same section.\n\n1-99 The disadvantages to a three-section organization are—\n  • Harder to gain fire superiority.\n  • Harder to mass personnel. Harder to conduct CASEVAC with dispersed distance.\n  • Harder to ensure senior leaders are in proper position to best influence to mission.",
                            "sub_subsection_image_id": "",
                            "sub_subsection_page_numbers": "1-97, 1-98, 1-99"
                        }
                    ]
                },
                {
                    "subsection_title": "ABCT CAVALRY SQUADRON SCOUT PLATOON",
                    "subsection_content": "1-100. The sound signature of the Bradley will be the most difficult factor to overcome. Leaders should allot additional time for dismounts to leave the vehicle at greater distances from the NAI to maintain stealth. Each platoon has one platoon leader, one PSG, and four squad leaders. As described above, for tactical employment, all leaders employ their sections using the wingman concept. The ABCT Cavalry squadron scout platoon has the following common equipment in each platoon:\n  • Six M2A3 Bradley fighting vehicles.\n  • M240L 7.62-mm machine gun.\n  • Javelin command launch unit.\n\n1-101.  The ABCT Cavalry squadron scout platoon capabilities include:\n  • Provide all weather, continuous, accurate, and timely reconnaissance and security in nonrestrictive terrain.\n  • Survivability and fight for information against appropriate threat.\n  • The M2A3 Bradley fighting vehicle armed with a 25-mm cannon, 7.62-mm coaxial machine gun, and tube launched, optically tracked, wire guided (TOW) missile system, provides firepower.\n\n1-102. The ABCT Cavalry squadron scout platoon limitations include:\n  • Limited maneuverability in urban environments and other types of complex terrain.\n  • The K-series modified table of organization and equipment also lacks the Long-Range Advance Scout Surveillance System (known as LRAS3) optic system for long-range target acquisition and surveillance and only has one fire support sensor system variant if attached a fire support team.\n\n1-103. The platoon’s vehicles create sustainment consideration for resupply, refueling, and maintenance despite the ABCTs enhanced sustainment capability.\n\n1-104. The following is a possible TASKORG for ABCT scout platoons that have 6 vehicles and 36 personnel. (See figure 1-1.)",
                    "subsection_image_id": "1-1",
                    "subsection_page_numbers": "1-100, 1-101, 1-102, 1-103, 1-104"
                },
                {
                    "subsection_title": "ABCT COMBINED ARMS BATTALION SCOUT PLATOON",
                    "subsection_content": "1-105. With eight vehicles, it is possible to have four, two vehicle sections. Four sections may be beneficial in some security postures, or if senior leaders need to be able to move to multiple sections to best influence the mission. Additionally, the platoon can task organize to have a section leader in a Bradley or a HMMWV. The advantage to the section leader in a HMMWV is a lower signature so they can operate forward, locate an enemy, and conduct a target handover to their wingman. The ABCT combined arms battalion scout platoon has the following common equipment:\n  • Three M2A3 Bradley vehicles.\n  • Fiveup-armored, HMMWVs.\n  • AN/TAS-8 LRAS3.\n  • Javelin command launch unit.\n  • MK19 40-mm machine gun grenade.\n  • .50 caliber heavy machine gun.\n  • M240L 7.62-mm machine gun.\n\n1-106. In addition to the capabilities and limitations discussed above in the ABCT Cavalry squadron scout platoon, the ABCT combined arms battalion scout platoon up-armored light-wheeled platforms provide greater stealth capabilities and limited protection and mobility.\n\n1-107. The following is a technique for scout platoons that have 3 Bradley fighting    vehicles, 5 light-wheeled platforms, and 36 personnel. (See figure 1-2.)",
                    "subsection_image_id": "1-2",
                    "subsection_page_numbers": "1-105, 1-106, 1-107"
                },
                {
                    "subsection_title": "SBCT SCOUT PLATOONS",
                    "subsection_content": "1-108. The SBCT Cavalry squadron and Stryker Infantry battalion scout platoon has one platoon leader, one PSG, and four squad leaders. As described above, for tactical employment, all leaders employ as sections using the wingman concept. The SBCT scout platoon has the following equipment in each platoon:\n  • Six Stryker vehicles.\n  • AN/TAS-8 LRAS3.\n  • Javelin command launch units.\n  • MK19 40-mm machine gun grenade.\n  • .50 caliber heavy machine gun.\n  • M240L 7.62-mm machine gun.\n\n1-109.  The SBCT Cavalry squadron scout platoon capabilities include—\n  • Provide all weather, continuous, accurate, and timely reconnaissance and security in nonrestrictive terrain.\n  • Provide reconnaissance and security for SBCT operations.\n  • Maximizing the teaming of ground scouts to conduct close reconnaissance of enemy forces.\n  • Fighting for information against light and motorized forces.\n\n1-110. The SBCT Cavalry squadron scout platoon has limitations in its ability to maneuver in complex terrain during inclement weather conditions.\n\n1-111. The following is possible TASKORG for SBCT Cavalry squadron scout platoons that have 6 vehicles and 36 personnel. Including the Stryker maneuver battalion scout platoons. (See figure 1-3)",
                    "subsection_image_id": "1-3",
                    "subsection_page_numbers": "1-108, 1-109, 1-110, 1-111"
                },
                {
                    "subsection_title": "IBCT SCOUT PLATOONS",
                    "subsection_content": "1-112. There are two types of scout platoons in the IBCT, platoons with vehicles for each section and a dismounted platoon. The paragraphs below discuss both types of scout platoons in the IBCT Cavalry troops.",
                    "subsection_image_id": "",
                    "subsection_page_numbers": "1-112"
                },
                {
                    "subsection_title": "IBCT CAVALRY SQUADRON MOUNTED TROOP SCOUT PLATOON",
                    "subsection_content": "1-113. The mounted IBCT scout platoon has one platoon leader, one PSG, and four squad leaders. As described above, for tactical employment, all leaders employ as sections using the wingman concept. The IBCT mounted scout platoon has the following equipment in each platoon:\n  • Sixup-armored, HMMWVs.\n  • AN/TAS-8 LRAS3.\n  • Javelin command launch units.\n  • MK19 40-mm machine gun grenade.\n  • .50 caliber heavy machine gun.\n  • M240L 7.62-mm machine gun.\n  • M41 TOW improvised target acquisition system.\n\n1-114.  The IBCT mounted scout platoon has the following capabilities:\n  • Provides reconnaissance and security for IBCT operations.\n  • Possesses two mounted TOW systems.\n  • Possesses greater firepower, mobility, and protection than IBCT units.\n  • Fights for information against appropriate threat.\n\n1-115.  The IBCT mounted scout platoon has the following limitations: The up-armored HMMWV provides limited protection.\n  • The up-armored HMMWV’s added weight limits mobility, especially in complex terrain.\n  • The mounted scout platoon has limited dismounts.\n\nThe following is possible TASKORG for the mounted scout platoons that have 6 vehicles and 24 personnel. (See figure 1-4)",
                    "subsection_image_id": "1-4",
                    "subsection_page_numbers": "1-113, 1-114, 1-115, 1-116"
                },
                {
                    "subsection_title": "IBCT CAVALRY SQUADRON DISMOUNTED TROOP SCOUT PLATOON",
                    "subsection_content": "1-117. The dismounted scout platoon is especially suited for conducting stealthy reconnaissance. In any instance, the scheme of support will be the biggest hindrance on successful mission accomplishment. Resupply of the dismounted troop may require mounted troops or external assets to assist. 11B Infantry Soldiers compose the IBCT dismounted troop scout platoon. They provide the dedicated dismounted capabilities of reconnaissance and security missions for IBCT operations.\n\n1-118.  The IBCT dismounted scout platoon has the following capabilities:\n  • Operate centralized or decentralized as three independent squads.\n  • Conduct stealthy reconnaissance and security tasks.\n  • Provide all weather, continuous, accurate, and timely reconnaissance and security in complex, close, restrictive, and urban terrain.\n  • Conduct ground, water, and air insertion.\n  • Conduct multiple reconnaissance and security tasks (area, zone, route reconnaissance) in complex terrain.\n\n1-119.  The IBCT dismounted scout platoon has the following limitations:\n  • Limited mounted capability, requiring augmentation of mobility platforms for rapid movement.\n  • Depends on the use of stealth, cover, concealment, and their dismounted patrolling skills to remain undetected.\n  • Limited direct-fire standoff, lethality, and survivability.\n  • Requires additional planning and employment time to reduce risk due to limited protection.\n  • Equipment and supplies limited to only what the platoon can man-pack or cache dismounted.\n  • Has digital tactical internet systems only in vehicles.\n\n1-120. Figure 1-5, illustrates a possible TASKORG for scout platoons that have 1 vehicle and 28 personnel.",
                    "subsection_image_id": "1-5",
                    "subsection_page_numbers": "1-117, 1-118, 1-119, 1-120"
                },
                {
                    "subsection_title": "INFANTRY BATTALION SCOUT PLATOON",
                    "subsection_content": "1-121. The Infantry battalion scout platoon serves as the forward reconnaissance and security element for the battalion commander. The primary mission of the scout platoon is to conduct reconnaissance and security to answer CCIR, normally defined within the battalion’s information collection plan. The platoon conducts route, zone, and area reconnaissance tasks. The platoon can also conduct limited screening missions and can participate as part of a larger force in guard tasks. The platoon has one officer and 21 enlisted personnel. The PSG assists and advises the platoon leader, and leads the platoon in the platoon leader’s absence.\n\n1-122. The scout platoon organizes into a platoon headquarters and three squads of six men each. Each SQDLDR is responsible for controlling their squad’s movement and information requirements. They report information collected that answers PIRs to the scout platoon leader or battalion command post.\n\n1-123. In either offensive or defensive operations, the commander may deploy scout platoons to conduct screening operations of the battalion’s front, flank, or rear. The scout platoon may also occupy outposts from which it can relay critical information to the battalion command post concerning enemy composition, disposition, and activities.\n\n1-124.  The Infantry battalion scout platoon has the following capabilities:\n  • Provides all weather, continuous, accurate, and timely reconnaissance and security in complex terrain.\n  • Conducts stealthy reconnaissance and security tasks.\n  • Assesses situations rapidly and directs combat power, reconnaissance, and security capabilities to support answering CCIRs.\n  • Employs integrated and synchronized reconnaissance to detect threat deception, decoys, and cover and concealment.\n  • Conducts insertion by ground, water, and air.\n\n1-125.  The Infantry battalion scout platoon has the following limitations:\n  • Limited dismounted capability if operating all eight of the platoon’s vehicles.\n  • Limited direct-fire standoff, lethality, and survivability.\n  • Dismounted tasks associated with zone, area, and route reconnaissance.\n  • Limited organic sustainment assets.\n\n1-126.  Figure 1-6, illustrates a possible TASKORG for IBCT Infantry battalion scout platoons that have 8 vehicles and 21 personnel.",
                    "subsection_image_id": "1-6",
                    "subsection_page_numbers": "1-121, 1-122, 1-123, 1-124, 1-125, 1-126"
                }
            ]
        }
    ]
}

